<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"3d43ba1891aa03fb8f35be4d69022b9cbf6794d112dc954669f2a6fd4eb22deb","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1568 at https://github.com/cal-itp/data-infra/actions/runs/22600622458","plan_out_hash":"185d75d01590fbc8a8777985c7b2bf6843d89bbe2760333de3c114f13f7fb56f","plan_hash":"25c0ac13ae5780908cea35390b7590cd2d5e1c767338a640ceea6896c72c2b78","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gtfs_csv_to_jsonl_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "Fb30Vg==" -> (known after apply)
!~      detect_md5hash      = "Gv1WkUpcJDSAE2xIrwJBPA==" -> "different hash"
!~      generation          = 1770764146935419 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gtfs_csv_to_jsonl_operator.py"
!~      md5hash             = "Gv1WkUpcJDSAE2xIrwJBPA==" -> (known after apply)
        name                = "plugins/operators/gtfs_csv_to_jsonl_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "OqktNg==" -> (known after apply)
!~      detect_md5hash      = "lTKou2gwj5sXAtQKh4oMiQ==" -> "different hash"
!~      generation          = 1772221895063281 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "lTKou2gwj5sXAtQKh4oMiQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "7o+yYA==" -> (known after apply)
!~      detect_md5hash      = "cvtUNxDmYDZ/QOS4tIF2YA==" -> "different hash"
!~      generation          = 1772221896817485 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "cvtUNxDmYDZ/QOS4tIF2YA==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1568](https://github.com/cal-itp/data-infra/actions/runs/22600622458)